# Use case python 3
<br><br>
**Dataset** : Titanic dataset. 
<br>
You can download it here.
<br>
https://drive.google.com/open?id=15IyT1ODuDKgZb8WN6iG64hFJRZWJTSAz
<br>
**Background** : The dataset contains data for 887 of the real Titanic passengers. Each row represents one person. The columns describe different attributes about the person including whether they survived (S), their age (A), their passenger-class (C), their sex (G) and the fare they paid (X). The table below shows the Data Dictionary.

**Objective** : Create a python script that contains the script to answer the questions below. Please put comments on the script to show which line of codes answers which questions. Please upload the script after you finish.

**Questions** :

1. What is the dimension (col, row) of the data frame?
2. How to know data type of each variable?
3. How many passengers survived (Survived=1) and not-survived (Survived=0)?
4. How to drop column ‘Name’ from the data frame?
5. Add one new column called ‘family’ to represent number of family-member aboard (hint: family = sibsp + parch)
6. As shown, columns ‘Age’ contains missing values. Please add new column named ‘Age_miss’ to indicate whether Age is missing or not (Age_miss = ‘YES’ for missing value and ‘NO’ for non-missing value). 
7. Please fill Age missing value with means of existing Age values
8. What is the maximum passenger Age who survived from the tragedy? 
9. How many passengers survived from each ‘PClass’? 
10. How to randomly split the data frame into 2 parts (titanic1 and titanic2) with proportion of 0.7 for tttanic1 and 0.3 for titanic2 ?

<br>
<br>
Importing necessary modules and packages

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

<br><br>
Importing data

In [4]:
data=pd.read_csv('titanic.csv')
data.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

<br><br>
## 1. What is the dimension (col,row) of the dataframe

In [31]:
print('row {} and column {}'.format(data.shape[0],data.shape[1]))

row 887 and column 8

## 2. How to know data type of each variable?

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null int64
Pclass                     887 non-null int64
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null int64
Parents/Children Aboard    887 non-null int64
Fare                       887 non-null float64
family                     887 non-null int64
dtypes: float64(2), int64(5), object(1)
memory usage: 55.5+ KB

<br>
As we can see, there are 2 types of data, int64 and float64

## 3. How many passengers survived? (survived=1), (notsurvived=0)

In [39]:
survived=data['Survived'].value_counts()
print('Passengers who survived : ',survived[1])

print('Passengers who not survived : ',survived[0])

Passengers who survived :  342
Passengers who not survived :  545

## 4. How to drop column ‘Name’ from the data frame?

Using data.drop(columns=[column_names])

In [41]:
data=data.drop(columns=['Name'])
data.head()

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family
0,0,3,male,22.0,1,0,7.2500,1
1,1,1,female,38.0,1,0,71.2833,1
2,1,3,female,26.0,0,0,7.9250,0
3,1,1,female,35.0,1,0,53.1000,1
4,0,3,male,35.0,0,0,8.0500,0

<br>
We see that column *name* is deleted

## 5. Add one new column called ‘family’ to represent number of family-member aboard (hint: family = sibsp + parch)

In [43]:
data['family']=data['Siblings/Spouses Aboard'] + data['Parents/Children Aboard']
data.head()

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family
0,0,3,male,22.0,1,0,7.2500,1
1,1,1,female,38.0,1,0,71.2833,1
2,1,3,female,26.0,0,0,7.9250,0
3,1,1,female,35.0,1,0,53.1000,1
4,0,3,male,35.0,0,0,8.0500,0

<br>
We see that new column 'family' has already been created

## 6. As shown, columns ‘Age’ contains missing values. Please add new column named ‘Age_miss’ to indicate whether Age is missing or not (Age_miss = ‘YES’ for missing value and ‘NO’ for non-missing value).

In [46]:
# there are 887 rows, and there are 887 non null so there is no null
null_age=data['Age'].isnull().sum()
print('Number of null in Age ',null_age)
if null_age==0:
    Age_miss='No'
else:
    Age_miss='Yes'

Age_miss

Number of null in Age  0

'No'

## 7. Please fill Age missing value with means of existing Age values

<br>
There are no null values in Age, so we don't have to fill missing value in age

## 8.What is the maximum passenger Age who survived from the tragedy?

In [50]:
print('Maximum passenger Age who survived : ',max(data['Age'][data['Survived']==1]))

Maximum passenger Age who survived :  80.0

## 9. How many passengers survived from each ‘PClass’?

In [52]:
p_class_survived=data[['Pclass','Survived']].groupby('Pclass').sum()
p_class_survived

        Survived
Pclass
1            136
2             87
3            119

In [60]:
print("Number of Pclass {} survived is {}".format(p_class_survived.index[0],p_class_survived.iloc[0,0]))
print("Number of Pclass {} survived is {}".format(p_class_survived.index[1],p_class_survived.iloc[1,0]))
print("Number of Pclass {} survived is {}".format(p_class_survived.index[2],p_class_survived.iloc[2,0]))

Number of Pclass 1 survived is 136
Number of Pclass 2 survived is 87
Number of Pclass 3 survived is 119

<br>

## 10. How to randomly split the data frame into 2 parts (titanic1 and titanic2) with proportion of 0.7 for tttanic1 and 0.3 for titanic2 ?

In [61]:
titanic1 = data.sample(frac=0.7).reset_index().drop(columns='index')
print(titanic1.shape)
titanic1.head()

(621, 8)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family
0,1,1,female,36.0,1,2,120.0000,3
1,0,3,male,23.0,0,0,14.5000,0
2,1,2,female,40.0,1,1,39.0000,2
3,0,3,male,16.0,1,3,34.3750,4
4,0,3,male,26.0,2,0,8.6625,2

In [64]:
titanic2 = data.drop(index=titanic1.index,axis=0).reset_index().drop(columns='index')
print(titanic2.shape)
titanic2.head()

(266, 8)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family
0,0,3,male,21.0,0,0,16.1000,0
1,0,1,male,61.0,0,0,32.3208,0
2,0,2,male,57.0,0,0,12.3500,0
3,1,1,female,21.0,0,0,77.9583,0
4,0,3,male,26.0,0,0,7.8958,0